<template>
    <GeneralHeader>
        <template v-slot:title>
            <p>قوانین و مقررات</p>
        </template>
        <template v-slot:content>
            <p>صفحه اصلی > قوانین و مقررات</p>
        </template>
    </GeneralHeader>
    <div class="general-background">
        <v-container class="conditions-container">
            <p class="title mt-5">
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ:
            </p>
            <p class="mb-2">با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد:</p>
            <p><v-icon class="ml-5 circle" color="primary">mdi-check-circle-outline</v-icon>تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی</p>
            <p><v-icon class="ml-5 circle" color="primary">mdi-check-circle-outline</v-icon>فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها</p>
            <p><v-icon class="ml-5 circle" color="primary">mdi-check-circle-outline</v-icon>شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>
            <p class="mt-3 mb-2">با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد:</p>
            <div class="frame">
                <p class="title">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ:
                </p>
                <p>با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد</p>
            </div>
            <p class="title mt-5">
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ:
            </p>
            <p class="mb-2">با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد  تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. </p>
            <p class="title mt-5">
                نکات مهم:
            </p>
            <p><v-icon class="ml-5 circle" color="primary">mdi-check-circle-outline</v-icon>تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی</p>
            <p><v-icon class="ml-5 circle" color="primary">mdi-check-circle-outline</v-icon>فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها</p>
            <p><v-icon class="ml-5 circle" color="primary">mdi-check-circle-outline</v-icon>شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>
        </v-container>
    </div>
</template>
<script lang="ts">
import GeneralHeader from "@/components/GeneralHeader.vue";
import { defineComponent } from "vue";

export default defineComponent({
    components: {
        GeneralHeader,
    },
});
</script>
<style lang="scss">
.conditions-container{
    line-height: 30px;
    .title{
        font-size: 17;
        font-weight: 600;
        
    }
    .circle{
        font-size: 17px;
    }
    .frame{
        background: #e9efff;
        margin: 20px auto;
        padding: 20px;
    }
}
</style>