<template>
    <GeneralHeader>
        <template v-slot:title>
            <p>سوالات متداول</p>
        </template>
        <template v-slot:content>
            <p>صفحه اصلی > سوالات متداول</p>
        </template>
    </GeneralHeader>
    <v-container class= "asked-questions-container">
        <div class="mt-5 mb-10">
            تعدادی سوال متداولند، یعمی حتی برای ما در ابتدای کار این سوالات پیش می آمد
            و هم اکنون ما می خواهیم قبل از پرسیده شدنشان پاسخ بدهیم! البته ممکن است
            تعدادی از سوال ها را جا انداخته باشیم! چه خوب است که از طریق <a href="/contact-us" class="text-black">فرم تماس با ما</a>
            آن ها را یادآوری کنید تا به اینجا اضافه شوند.
        </div>
        <v-expansion-panels>
            <v-expansion-panel
                v-for="index in questions.length"
                :key="index"
                class="panel">
                <v-expansion-panel-title>{{ questions[index-1].question }}</v-expansion-panel-title>
                <v-expansion-panel-text>{{ questions[index-1].answer }}</v-expansion-panel-text>
            </v-expansion-panel>
        </v-expansion-panels>
        <div class="more-questions">
            <p class="title">هنوز هم سوال دارید؟</p>
            <v-row>
                <v-col md="10" cols="12">
                    <p>اگر هنوز سوالاتی دارید که پاسخ آن ها را در اینجا پیدا نکردید می توانید با ثبت نام در سایت در قسمت پشتیبانی از کارشناسان ما بپرسید و راهنمایی بگیرید!</p>
                </v-col>
                <v-col md="2" cols="12" align="center">
                    <v-btn variant="flat" rounded="pill" color="primary" class="suport-btn" :to="{ name: 'contact-us' }">پشتیبانی</v-btn>
                </v-col>
            </v-row>
        </div>
    </v-container>
</template>
<script lang="ts">
import GeneralHeader from "@/components/GeneralHeader.vue";

import { defineComponent } from "vue";

export default defineComponent({
    components: {
        GeneralHeader,
    },
    data() {
        return {
            questions:[
                {
                    question:"دامنه چیست و چرا به آن نیاز داریم؟",
                    answer:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
                },
                {
                    question:"منظور از پسوند دامنه چیست؟کدام پسوند برای من مناسبتر است؟",
                    answer:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
                },
                {
                    question:"چگونه می توانم آزاد بودن یک دامنه را بررسی کنم؟",
                    answer:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
                },
                {
                    question:"چقدر طول می کشد تا دامنه ی خریداری شده ثبت شود؟",
                    answer:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
                },
                {
                    question:"دامنه چیست و چرا به آن نیاز داریم؟",
                    answer:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
                },
                {
                    question:"منظور از پسوند دامنه چیست؟کدام پسوند برای من مناسبتر است؟",
                    answer:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
                },
                {
                    question:"چگونه می توانم آزاد بودن یک دامنه را بررسی کنم؟",
                    answer:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
                },
                {
                    question:"چقدر طول می کشد تا دامنه ی خریداری شده ثبت شود؟",
                    answer:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
                }
            ]
        };
    },
});
</script>
<style lang="scss">
.asked-questions-container{
    .panel {
    padding: 6px;
    margin: 10px;
    font-size: 14px;
    line-height: 22px;
    text-align: right;
    .v-expansion-panel-title {
        line-height: 25px;
        font-size: 15px;
        font-weight: 500;
    }
    .v-expansion-panel__shadow {
        box-shadow: none;
        border: 0px;
    }
    .v-expansion-panel-text__wrapper {
        padding: 20px 28px;
    }
    .v-expansion-panel-title--active {
        background: #4f80ff;
        color: white;
    }
    .v-expansion-panel--before-active {
        border: 0px;
    }
    .v-expansion-panel-title__overlay {
        background-color: transparent;
    }
    
  }
  .v-expansion-panel{
        --v-border-opacity: 0;
  }
  .more-questions{
    background: #e9efff;
    margin: 40px auto 30px auto;
    padding: 30px;
    line-height: 30px;
    .title{
        font-weight: 900;
    }
    .suport-btn{
        font-weight: 800;
        font-size: 13px;
        padding: 9px 40px;
        height: 40px;
    }
  }
  @media(max-width: 600px) {
    .panel {
        .v-expansion-panel-title {
            padding: 16px 5px;
        }
        .v-expansion-panel-text__wrapper {
        padding: 20px 10px;
        }
    }
    .more-questions{
        padding: 20px 15px;
    }
  }
}
</style>