export interface IPost {
    id: number;
    permalink: string;
    title: string;
    content: string;
    author: {
        id: number;
        name: string;
    };
    picture: any;
    date: number;
    category: string[];
}

export interface Tab{
    name:string,
    value:string,
}

export function getBlogIndex(){
    return[
        [
            {
                name:"همه",
                value:"all"
            },
            {
                name:"جدیدترین",
                value:"latest"
            },
            {
                name:"پربازدیدترین",
                value:"popular"
            },
            {
                name:"اخبار جی دامین",
                value:"news"
            }
        ],
        [
            {
                id: 1,
                permalink: "",
                title: "1 لورم ایپسوم یا طرح‌نما متنی ساختگی",
                content: "1 لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ",
                author: { id: 1, name: "1 کاربر تست" },
                picture: "src/assets/pics/blog1.png",
                date: 1673598370158,
                category:["latest","popular"]
            },
            {
                id: 2,
                permalink: "",
                title: "2 لورم ایپسوم یا طرح‌نما متنی ساختگی",
                content: "2 لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ",
                author: { id: 2, name: "2 کاربر تست" },
                picture: "src/assets/pics/blog1.png",
                date: 1673598370158,
                category:["latest","popular","news"]
            },
            {
                id: 3,
                permalink: "",
                title: "3 لورم ایپسوم یا طرح‌نما متنی ساختگی",
                content: "3 لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ",
                author: { id: 3, name: "3 کاربر تست" },
                picture: "src/assets/pics/blog1.png",
                date: 1673598370158,
                category:["latest"]
            },
            {
                id: 4,
                permalink: "",
                title: "4 لورم ایپسوم یا طرح‌نما متنی ساختگی",
                content: "4 لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ",
                author: { id: 4, name: "4 کاربر تست" },
                picture: "src/assets/pics/blog1.png",
                date: 1673598370158,
                category:["latest","news"]
            },
            {
                id: 5,
                permalink: "",
                title: "5 لورم ایپسوم یا طرح‌نما متنی ساختگی",
                content: "5 لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ",
                author: { id: 5, name: "5 کاربر تست" },
                picture: "src/assets/pics/blog1.png",
                date: 1673598370158,
                category:["latest","popular","news"]
            },
            {
                id: 6,
                permalink: "",
                title: "6 لورم ایپسوم یا طرح‌نما متنی ساختگی",
                content: "6 لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ",
                author: { id: 6, name: "6 کاربر تست" },
                picture: "src/assets/pics/blog1.png",
                date: 1673598370158,
                category:["news","popular"]
            },
            {
                id: 7,
                permalink: "",
                title: "7 لورم ایپسوم یا طرح‌نما متنی ساختگی",
                content: "7 لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ",
                author: { id: 7, name: "7 کاربر تست" },
                picture: "src/assets/pics/blog1.png",
                date: 1673598370158,
                category:["news","popular"]
            },
            {
                id: 8,
                permalink: "",
                title: "8 لورم ایپسوم یا طرح‌نما متنی ساختگی",
                content: "8 لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ",
                author: { id: 8, name: "8 کاربر تست" },
                picture: "src/assets/pics/blog1.png",
                date: 1673598370158,
                category:["news","latest"]
                
            },
            {
                id: 9,
                permalink: "",
                title: "9 لورم ایپسوم یا طرح‌نما متنی ساختگی",
                content: "9 لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ",
                author: { id: 9, name: "9 کاربر تست" },
                picture: "src/assets/pics/blog1.png",
                date: 1673598370158,
                category:["news","popular"]
            },
            {
                id: 10,
                permalink: "",
                title: "10 لورم ایپسوم یا طرح‌نما متنی ساختگی",
                content: "10 لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ",
                author: { id: 10, name: "10 کاربر تست" },
                picture: "src/assets/pics/blog1.png",
                date: 1673598370158,
                category:["news","popular"]
            }  
        ]
    ]
}